Public Member Functions | Friends | List of all members
ACAPI::Library::LibPart Class Reference
Library Management
LibPart is the representation of a file-like item in a Library (.gsm, .png, .lis, etc..) More...
#include <LibPart.hpp>
 Inheritance diagram for ACAPI::Library::LibPart:
 Public Member Functions
ACAPI::Result< GS::UniString >  | GetName () const
The name of the library part.
ACAPI::Result< IO::Location >  | GetLocation () const
The location of the library part file.
ACAPI::Result< LibPartType >  | GetType () const
The file type of the library part.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::LibraryManagerImpl
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
LibPart is the representation of a file-like item in a Library (.gsm, .png, .lis, etc..)
Since
Archicad 28